Revit 2024 API
FamilyTypeSet.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual bool Insert(
	FamilyType item
)
Visual Basic
Public Overridable Function Insert ( _
	item As FamilyType _
) As Boolean
Visual C++
public:
virtual bool Insert(
	FamilyType^ item
)
Parameters
item
Type: Autodesk.Revit.DB.FamilyType
See Also
FamilyTypeSet Class
Autodesk.Revit.DB Namespace